test_mode = 0

wallets = open('wallets.txt')  # Файл с приватниками
approving_switch = 0  # Включен ли модуль апрувов # если включён, то даёт апрув WETH к первым 10-ти тирам
purchase_switch = 1  # Включен ли модуль покупок

tier = 1  # Из какого тира будем покупать ноды
lot_number = 10  # Количество нод для покупки за раз
discount_code = 'icodrops'  # Код для кэшбека (Если с кодом не работает то ставь '-', чтобы вызвался метод без кода)

network_rpc = 'https://1rpc.io/zksync2-era'  # RPC сети
weth_address = '0x5AEa5775959fBC2557Cc8789bC1bf90A239D9a91'  # Адрес wETH в сети

start_time = 1714467600  # Время старта сейла в Unix формате ( Sophon 1714467600 ). В это время скрипт будет начинать делать симуляцию транзакций. Если 0 - скрипт сразу начинает делать симуляцию

txn_type = 2  # тип транзакции | 0 - Legacy  | 2 - EIP-1559
gas_price_mult = (2.00, 3.00)  # Множитель максимальной цены газа
priority_mult = (1.20, 1.40)  # Множитель минимальной цены газа (priority)
gas_mult = (1.45, 1.75)  # Добавочный процент для количества газа

simulation_enable = 1  # Включена ли симуляция транзакции

delay = (1, 1)  # Перерыв в случае неудачи

simple_purchase = 0  # Если вдруг сейл идет по простой функции purchase, то ставим 1

smart_contract_source = 0  # 1 - Подтягиваем параметры для транз из смартконтракта; 0 - используем записанные ранее

proof_empty = 1  # 1 - Пустой пруф в транзе; 0 пруф = 0x00000000000000000000000000000000000000000000000000000000000000

no_gas_check = 0  # транза без проверки газа.
