test_mode = 0

wallets = open('wallets.txt')  # Файл с приватниками
approving_switch = 0  # Включен ли модуль апрувов
purchase_switch = 1  # Включен ли модуль покупок

tier = 1  # Из какого тира будем покупать ноды
lot_number = 5  # Количество нод для покупки за раз
discount_code = 'crypto_earn_important'  # Код для кэшбека (Если с кодом не работает то ставь '-', чтобы вызвался метод без кода)

arbitrum_rpc = 'https://arbitrum-one-rpc.publicnode.com'

start_time = 1710928800  # Время старта сейла в Unix формате. В это время скрипт будет начинать делать симуляцию транзакций. Если 0 - скрипт сразу начинает делать симуляцию

gas_price_mult = [3, 5]  # Множитель цены газа
gas_mult = [1.20, 1.25]  # Множитель количества газа

delay = [1, 1]  # Перерыв в случае неудачи

simple_purchase = 0  # Если вдруг сейл идет по простой функции purchase, то ставим 1

smart_contract_source = 0  # 1 - Подтягиваем параметры для транз из смартконтракта; 0 - используем записанные ранее

proof_empty = 1  # 1 - Пустой пруф в транзе; 0 пруф = 0x00000000000000000000000000000000000000000000000000000000000000

no_gas_check = 0  # транза без проверки газа.
